Autodesk.Revit.DB.BuiltInFailures.SpanDirectionSymbolFailures.NonPlanView
Span Direction Symbol can only be placed in a Floor Plan View.

Autodesk.Revit.DB.BuiltInFailures.SpanDirectionSymbolFailures
Failures about SpanDirectionSymbol.